[
{"text": "Just because airlines don't want passengers video chatting from phones while they're in the air doesn't mean there was never a thought of selling it as a service, and as a result some airplanes have seat-back entertainment systems with a camera embedded. However, even if they're not plugged into a service, privacy-conscious fliers have raised enough concern -- the idea that someone could be watching, or that it could enable facial recognition is  admittedly creepy  -- that United Airlines has used stickers to cover up cameras that exist in some of its systems. In a statement to  Buzzfeed News , a United spokesperson said \"None of these cameras were ever activated and we had no plans to use them in the future, however we took the additional step to cover the cameras. The cameras are a standard feature that manufacturers of the system included for possible future purposes such as video conferencing.\" However, United isn't the only airline with such hardware installed, as the report points out, much of the uproar over these cameras occurred after fliers spotted the devices in systems on American Airlines and Singapore Airlines flights (both said the cameras are disabled on their planes).                   \n  \n  \n  "},
{"text": "National Geographic is delving deeper into VR with a 30-minute Antarctic adventure that will hit  Oculus Quest  this spring. In National Geographic Explore VR, you'll be tasked with finding a lost penguin colony. The adventure will take you on a kayak ride through frigid water, and on a climb up an ice sheet as you search for the missing birds. Using the  Oculus Touch controllers,  you'll be able to set up camp, form a wind barricade and zip up your tent to help you get a sense of what it might be like to survive such a tough environment. The National Geographic Partners Immersive Experiences team has been working with Oculus and VR/AR studio Force Field on Explore VR for the last nine months. More adventures will be available through the app over the coming months, including archaeological expeditions to cultural heritage sites. National Geographic is also working with YouTube on a series of VR projects,  the first of which  was released in December. Meanwhile, Facebook is set to release its standalone Oculus Quest headset  sometime this spring . A number of games and experiences have been announced for it, including  Vader Immortal - A Star Wars VR Series,   Beat Saber,   Moss  and  Superhot ."},
{"text": "Ever since Elon Musk  tweeted about taking Tesla private  his use of the platform  has been troublesome  in the government's eyes, but today the CEO reached an amended agreement with the SEC. According to  Reuters , if a judge approves the deal then charges of contempt in his earlier settlement will be dropped. It requires that Musk get prior approval from Tesla's legal department when he makes public statements about the company's finances. In December,  Musk told  60 Minutes  \"I do not respect the SEC\" and cited the First Amendment. The SEC  sought to hold him in contempt  due to a  February tweet  that overstated how many vehicles Tesla projected to build this year. A  copy of the agreement , uploaded by BBC reporter Dave Lee, shows the specific language added that explains:                   \n  \n  \n  "},
{"text": "Intel is looking to sell its smartphone-modem business, now that it's officially out of the race for 5G chipsets,  The Wall Street Journal  reports. In fact, Apple considered acquiring part of Intel's modem ventures in talks that began last summer, but that deal stopped short just as Apple and Qualcomm reached  a settlement  in a contentious patent-royalty legal dispute. By the end of that court battle, Apple and Qualcomm had signed a multi-year chipset-supply deal -- which meant  Intel was out . Now, Intel is pivoting and looking to offload its smartphone-modem business as a whole, according to  WSJ . Apple is still a possible buyer, though a few other companies have expressed interest and Intel is working with Goldman Sachs to facilitate negotiations. The deal will likely be worth a few billion dollars, though it's all in an early stage for now, the report says. Qualcomm was Apple's sole smartphone-chipset supplier before the companies entered a game of  lawsuit chicken  in 2017, suing each other over patent-royalty and contract violations. During this time, Intel took over as Apple's modem supplier. Intel recently denied  rumors  that Apple didn't have confidence in the company to deliver 5G modems by  its goal of 2020 . Meanwhile, Qualcomm is already rolling out  5G-capable modems . \"We are very excited about the opportunity in 5G and the 'cloudification' of the network, but in the smartphone modem business it has become apparent that there is no clear path to profitability and positive returns,\"  Intel CEO Bob Swan  said on April 16th, the day Apple and Qualcomm settled their legal cases and announced their renewed chipset deal. Intel's modem business is losing the company about $1 billion annually, according to  WSJ , and a sale will likely include staff, patents and modem designs across multiple technology generations."},
{"text": "The Tribeca Film Festival is underway, and it's live-streaming a handful of its talks. Through the festival's  Facebook page , you can watch conversations with celebs like Queen Latifah, Michael J. Fox, Denis Leary, Ali Wong and Tiffany Haddish. You can also catch cast members from  In Living Color , who will reunite to reflect on the show, and Dr. Ruth Westheimer, who's now 90 years old and will talk about her journey from Holocaust survivor to household name as a sex therapist. The festival runs through May 5th, and you can find the full schedule of the live-streamed talks  here . To watch, head over to the Tribeca Film Festival  Facebook page ."},
{"text": "In response to questions after  a speech  Friday in front of the Council on Foreign Relations, FBI director Christopher Wray called  Russian efforts using social media to influence elections in the US  \"pretty much a 365-days-a-year\" threat. According to the  New York Times , an unnamed senior official said that a Foreign Influence Task Force at the agency that  had been formed temporarily ahead of the midterm elections  in response to the threat is now permanent, and that nearly 40 agents and analysts had been moved into it. It also reported the midterm election task force at the Department of Homeland Security is now permanent, and the same goes for a joint task force formed by the National Security Agency and US Cyber Command. One of the possibilities they described preparing for is that an influence campaign could try to raise questions about irregularities or possible fraud in results -- items the president has already claimed are problems but blaming very different sources. While those operations were apparently  at \"full speed\" in the 2018 cycle , Wray called that a \"dress rehearsal\" for 2020."},
{"text": "August's View doorbell  hasn't had a stellar launch.  The smart home company  is \"pausing\"  shipments of the View after reports of \"performance challenges\" in certain households.  While it didn't say what those issues were,  The Ambient   noted  that the View frequently disconnected from WiFi, rendering its camera less than useful for keeping watch over your front door.  August vowed to use the shipping freeze to gauge feedback and make \"critical improvements\" to the smart doorbell. In exchange for the trouble, August is offering  refunds  to those customers who are willing to keep their Views and provide feedback.  Those who aren't happy, meanwhile, have been asked to return their doorbells to stores. The company is adamant that it will resume sales of the View \"in the near future\" and will let people know when there's a specific date.  It's an important gesture and shows that the company is determined to do right by its customers.  At the same time, there's no doubt that this is a blow to August's expanding smart home ambitions -- it's going to have that much tougher a time competing against heavyweights like  Amazon's Ring ."},
{"text": "Ford disclosed in a financial  filing  made with the United States Securities and Exchange Commission that it is currently under investigation by the Department of Justice over its internal testing practices. Ford says the probe is still in its preliminary stages but insists that this won't be another Volkswagen style  \"Dieselgate\" scandal . According to the carmaker, the issue stems from miscalculations made during the testing process rather than an intentional attempt to deceive regulators. In February, Ford launched its own investigation into emissions testing practices at the prompting of employees who noticed inconsistencies in results. The whistleblowers believe that Ford may have been miscalculating \"road load,\" or factors that affect a car while it is traveling. That includes aerodynamic drag and tire resistance. A lab test that doesn't accurately accounts for those forces that a vehicle would face while on the road could lead to better fuel economy projections, and therefore suggest cars are emitting less pollution than it actually does. In addition to the internal investigation, Ford has also flagged the Environmental Protection Agency and is working with the California Air Resources Board to help address the issues. The proactive steps seem to jive with the fact that Ford isn't intentionally trying to skirt rules but rather legitimately made mistakes in calculating its figures. Ford isn't the only company facing an investigation regarding emissions at the moment.  Daimler , the parent company of Mercedez-Benz, and  Fiat Chrysler  are also dealing with criminal probes of their own, though both companies are accused of using defeat devices and software to make cars appear to run cleaner than they actually do."},
{"text": "Former NBA star Rick Fox is leaving the esports team he owns, Echo Fox, after accusing a shareholder of an \"abhorrent display of pure racism\" and making threats to his family, according to an email obtained by  Dexerto . Echo Fox has confirmed the incidents of racism, verifying the account in Fox's email, and the authoritative body behind North American  League of Legends  esports is investigating the allegations. Here's how Echo Fox explains the situation (emphasis original): LCS commissioner Chris Greeley announced an investigation into the issue  on Twitter  last night. \"We are aware of recent allegations of a team owner using offensive and discriminatory language,\" he wrote. \"The LCS believes in creating a fair and inclusive environment for everyone and the alleged comments are contrary to our values and have no place in our league. We have launched an investigation into the allegations and will respond accordingly, based on available actions within our team agreements and the LCS Rules.\" Echo Fox is one of the  10 franchised teams  in the  League  Championship Series, though since Fox bought the organization in 2015, it's expanded to support players in other franchises, including Street Fighter, Super Smash Bros., Injustice and a few more fighting games. Top fighting-game competitor SonicFox, who claimed the title of Best Esports Player at the  2018 Game Awards , shared support for Fox on Twitter, echoing similar sentiments from others who've worked with him. Quoting a tweet with the  Dexerto  report, SonicFox  wrote , \"I respect my boss so much if this is the case. He has been a big inspiration to me and if he chooses to leave, I hope he stays in Esports as his passion and support for it is limitless.\" Echo Fox declined to comment further on the issue, while representatives for Rick Fox and the LCS didn't respond to Engadget before publication. In the internal email published by  Dexerto , Fox announced his intention to leave the organization as soon as possible, saying his shares were available and he would move \"on the first deal that sits well.\" \"The recent outrageous and abhorrent display of pure racism made by a significant Echo Fox shareholder as well as threats to my family have made it impossible for me to continue to remain associated with the company,\" Fox wrote. \"I will not support or be associated with such behaviour and attitudes displayed at the shareholder level. Racism is an anathema to what my personal brand strives for and tolerating any form of discrimination such as this is not acceptable.\" Dexerto  reported that the inciting incident was a shareholder at Vision Venture Partners using the n-word to describe former Echo Fox CEO Jace Hall. It wasn't a solitary event, though -- this particular partner displayed a pattern of racism directed at both Hall and Fox, according to the report. Fox was one of the first people from traditional sports to  embrace professional gaming . After retiring from a 13-year NBA career with the Boston Celtics and LA Lakers, Fox bought Gravity, a major  League of Legends  team, in 2015 under the Vision Venture Partners banner. He rebranded, and Echo Fox has been a mainstay in the NA LCS ever since, securing a coveted franchise spot for $10 million in 2018. That same year, Vision Venture Partners raised  $38 million  for its professional-gaming efforts from some big names in sports, including Kevin Durant, Odell Beckham Jr., and the St. Louis Cardinals. Fox appears to be leaving Echo Fox, but it's unclear if he's severing ties with Vision Venture Partners as well."},
{"text": "The inaugural  FIFA 19  UEFA eChampions League  just got serious. After weeks of online knockout play, the in-person Group Stages  are underway  at Manchester's Victoria Warehouse. The more definitive phase has 64 pro  FIFA 19  PS4 players challenging each other between April 26th and April 27th to become one of just eight people who'll reach the league final in Madrid on May 31st. These decisive stages will include a few very high-profile players who are likely to make it to the final, including F2Tekkz, Maestro, MsDossary and Nicolas99FC. The eChampions League doesn't have as high stakes as some tourneys, with a grand prize of $100,000 awaiting the best virtual footballer. However, it's really a litmus test for the demand for officially sanctioned esports tourneys like this. If the league proves a hit, you might see it grow in scope going forward."},
{"text": "Tobii is putting its  eye tracking technology  to work in a very practical way: it's making your day-to-day computing just that much more private and, ideally, more personal. A  new version  of its Aware software uses your PC's Windows Hello-capable camera to, among other things, blur and lock your screen when you're not looking. You won't have to worry that someone will peep a confidential email when you step away from your computer for a few minutes. The screen can automatically dim when you walk away, too, so you won't feel quite so guilty about wasting power. Some additions are focused solely on making your life easier. The eye tracking can send your mouse cursor or whole windows to different monitors. It'll also provide data on your screen time, your distance from the screen and the last time you took a break. You'll know when it's time to give your eyes some rest. While the software isn't device-specific, there is a showcase machine --  Lenovo's Yoga A940  all-in-one includes Tobii Aware in the box. Whatever machine you use it with, Tobii is clearly hoping for a world where attention and presence detection are par for the course, rather than the nice-to-have perks they are today."},
{"text": "Despite Google's attempts to improve  Gmail , the  web version  remains hectic and cluttered. While that might be frustrating to users, it's especially irritating for Michael Leggett, one of Gmail's former lead designers. Finally fed up, Leggett launched  Simplify , a free Chrome extension meant to streamline your inbox. Simplify moves all of Gmail's sidebar icons to discrete drop-down and pull-up menus. It relocates the search feature to a less prominent location and moves core functions, like delete, to the top bar. It also eliminates color-coded labels, and places the create new mail button in the bottom right corner, where the new mail window opens. It's all about improving Gmail's user interface, which Leggett has been trying to do for more than a decade. As  Fast Company  reports , after leaving Gmail, Leggett co-founded  Inbox , and later, while working on products like Messenger for Facebook, he continued to think about Gmail. He developed extensions to redesign other sites, and when Google  killed Inbox , he decided to share Simplify. The extension has reportedly been downloaded more than 15,000 times, with about 500 new installs per day. It doesn't deliver ads or collect analytics, and Legget has shared the code  on Github . He's had an offer to sell, but says he'll keep Simplify free -- though he hasn't ruled out creating a separate paid service."},
{"text": "After seeing  Avengers Endgame  in IMAX, I kicked myself for not doing the same for  Infinity War . The technical advantages are clear: IMAX screens are much larger than normal theaters, especially if you're lucky enough to have access to a full-sized IMAX. And while we've seen the format used before for action sequences in blockbusters,  Avengers Infinity War  and  Endgame  are the first to be shot entirely with IMAX cameras. So, unlike  The Dark Knight , they don't awkwardly jump between multiple aspect ratios. They're always super-sized, offering up to a 26 percent larger image than traditional widescreen theaters -- all the better to see Marvel's heroes finally smack down Thanos. It's fitting that the first films to be shot entirely in IMAX are some of the biggest movies ever made.  Avengers Infinity War  and  Endgame  are the culmination of the Marvel Cinematic Universe, a 10-year pop culture journey that spans 22 films and multiple TV shows. It started as an experiment for Marvel, connecting  Iron Man  with the forgotten 2008  Incredible Hulk , and eventually  Thor  and  Captain America . That first phase of films was successful enough to lead to their first team-up, 2012's  The Avengers . And everything just kept rolling from there. It's not a huge spoiler to say that  Endgame  pays tribute to the MCU's legacy -- and part of that involves some of the largest scale superhero battles we've ever seen on screen. Directors Joe and Anthony Russo shot their Avengers films with a custom 6K version of ARRI's large-format Alexa 65 digital camera. That helped them get IMAX-sized picture quality without the format's film cameras, which are notoriously bulky, hard to operate and loud (not a great thing for dialog scenes). There's a quality cost -- IMAX says its film cameras offer a higher 18K resolution -- but the added flexibility was worth it, allowing the Russos to bring the Alexa 65 just about anywhere. Their 6K resolution is also more than enough for the new 4K laser projectors in IMAX theaters (most aren't equipped to support the company's traditional 70mm film). Those additional pixels don't go to waste, though, IMAX uses them to create a better quality image. \"While projectors don't show [18K] other than our film ones... we employ a lot of technology around that,\" IMAX CTO Brian Bonnick said in an interview with Engadget. \"We scan the film into its digital form at the highest possible resolution, and we process it throughout the entire food chain at these higher resolutions. It's a technique called oversampling. What it means is that when you get to that 4K final content, because you've been processing it at a much higher resolution, you actually get a better quality image.\" While  Avengers Endgame  didn't leave me stunned with its IMAX presentation like  Dunkirk , an audacious film that used the format's massive film cameras, there were still plenty of moments where I was grateful to have that slightly larger screen. Seeing Tony Stark stranded in the vastness of space, with a broken ship and no hope in sight, felt all the more isolating. And by the time we get to the inevitable superhero throwdown, there's so much action on screen that even the 76-foot high IMAX screen at NYC's AMC Lincoln Square could barely contain it. As the credits rolled, I realized this wasn't an experience I could recreate at home -- even with my living room projector -- or any other theater for that matter. You could argue this isn't really new. Ever since Christopher Nolan made the bold decision to use IMAX cameras in  The Dark Knight , a groundbreaking way to create larger-than-life action sequences, other blockbusters followed suit (notably,  Mission Impossible: Ghost Protocol  and  Fallout ). But at least with those films, I was only losing the IMAX thrill from a few scenes. With  Endgame , I'll never be able to have the same experience again. It's not just the screen size, either. Bonnick says that IMAX goes to great lengths to ensure pristine moviegoing: \"Every morning when the system powers up in a theater, there's custom camera that looks at the screen, there are microphones in the theater that listen to the sound, and we run full diagnostics and calibration checks to make sure the sound is playing back exactly as it should,\" he said. It might seem like overkill, but it's the only way to make sure that the brightness, projection quality and sound are all up to snuff. Whereas other theaters tend to degrade over time, the daily calibrations help IMAX theaters to maintain their overall quality. While IMAX doesn't use object-based surround sound like Dolby Atmos, Bonnick notes that its 12-channel system has its own benefits. Its loudspeakers are designed to create sweet spots across large areas of the theater, rather than dead center like most cinemas. They're also able to create \"phantom imaging,\" meaning sounds can appear to come from specific points without actually having a speaker there. Instead of investing in 30 to 40 speakers, Bonnick says IMAX screens can rely on just 12 custom ones with low distortion. Additionally, their amplifiers can pump out thousands of watts of power, but most of the time they're only using 300 watts. That gives them head room to pump things up for dramatic moments, Bonnick says. \"We want to have extended dynamic range so that you can hear a pin drop. If a rocket ship is roaring off, we have the power to give that sound to you without it experiencing distortion.\" Of course, not every IMAX screen offers an immersive 70-foot plus experience. A decade ago, comedian  Aziz Ansari started an online firestorm  when he realized IMAX digital screens were significantly smaller. These days, the vast majority of  IMAX auditoriums in multiplexes are retrofitted , so they can only get as large as the size of the room. Still, these so-called \"Lie-MAX\" screens offer larger images than the average digital cinema, and they have the added advantage of IMAX's sound design. And in the case of Avengers Endgame, you'll still get to see much more of the film. If you've been following the Marvel films since  Iron Man ,  Endgame  will feel like the end of a pop culture era. It's a punctuation mark on a bold experiment, one that finally brought the joys of comic book-style serial storytelling to films. For that reason alone, it deserves to be seen on the biggest IMAX screen you can find. Images: Marvel"},
{"text": "Google is banning a major Android developer DO Global and removing its apps from the Google Play Store after it was discovered the company was  committing ad fraud . Nearly half of the developer's more than 100 apps have already been removed from Google's app marketplace and it's expected the rest will disappear in the coming days, according to  BuzzFeed . Apps published by DO Global, which is in part owned by massive Chinese tech firm Baidu, have racked up more than 600 million downloads in the Play Store. While DO Global isn't the first app developer to get  banned from Google's marketplace , it is one of the biggest. In addition to having its apps removed from the platform, DO Global also appears to have been given the boot from Google's  AdMob network . That would mean the company is no longer allowed to market its products through Google's massive mobile advertising service. Google's removal of DO Global comes after a  BuzzFeed  report that found at least six of the company's apps included code that made it seem as though a user was clicking on advertisements even when they weren't using the apps. The apps in question had generic names like Selfie Camera and Total Cleaner and seemed to intentionally obscure the fact they were owned by DO Global, which violates Play Store policy."},
{"text": "Amazon  could be preparing to set itself apart from rivals like  Spotify  and  Apple  in the music space, as it's said to be working on a high-fidelity streaming platform. It might arrive later this year for around $15/month.  Amazon Music Unlimited   starts at  $4/month, while Amazon  added  a free, ad-supported music service to Alexa devices last week. The rumored upcoming platform will reportedly offer \"better than CD quality\" music. So far, at least one major record company has signed up to license its recordings,  according to   Music Business Worldwide , while Amazon is supposedly in talks with other significant rights holders. If the platform comes to light, it could help Amazon differentiate itself further from Spotify and  Apple Music , neither of which have high-fidelity options. At the $15/month price level, the platform would undercut the likes of  Tidal  and  Deezer , both of which offer high-fidelity tiers for $20/month. Amazon could eat into both of their user numbers significantly if it bundles its subscription with its other services, or, for instance, offers  Prime members  a discount. However, a higher bit rate means more data, and many users will need to be conscious of how much their data allowance music streaming is gobbling up. As such, they might be happy to stick with the current offerings on the market."},
{"text": "Too many cities are built around cars rather than people. Sidewalk Labs, an offshoot of Google's parent company Alphabet, wants  its smart neighborhood in Toronto  to be different. It's considering a so-called superblock concept,  modeled after Barcelona's , that bundles smaller streets together and limits vehicles to the perimeter. The smaller lanes inside each superblock would then become safer, quieter spaces for pedestrians and cyclists. Sidewalk Labs wants to go a step further, though, with real-time traffic monitoring and movable street furniture. These would allow the company to create smart, dynamic superblocks that subtly change with the time of day and needs of its residents. In  a new report , Sidewalk Labs pitches four basic road types for Quayside. The widest and busiest, called Boulevards, would allow traditional cars with a driver behind the wheel. These would be limited to the outside of each superblock, however, while a network of smaller Laneways, Accessways and Transitways crisscross inside. Sidewalk Labs also wants to track and predict usage with a combination of low-cost sensors and machine learning algorithms. It would then use this information to alter the structure of each Boulevard and the vehicles that are allowed to move through them. The company has shown off its modular pavement system before. These hexagonal pads have embedded lights that can change color to visualize lanes or pedestrian-only sidewalks. The company says it would use these Dynamic Curbs to prioritize transit during rush hour and carve out relaxing public spaces at off-peak times and during national holidays. Some parts of the boulevard would be fixed -- you can't dig up a tram line, for instance -- but most would be reconfigurable. Connected and autonomous vehicles (CAVs) would, crucially, be allowed on the smaller streets inside each superblock. The top speed of these machines, which could include pods, e-bikes and electric scooters, would be software-limited and change depending on the street type they're on. On a super-narrow Laneway, for instance, they could only travel at up to 4MPH (8KMH), but on a wider Transitway they might reach 25MPH (40KMH). CAVs would be programmed to take the fastest route to your preferred destination. Navigation software would, therefore, push them toward the faster Boulevards and keep the inside of each superblock open for pedestrians. Sidewalk says CAVs could be hard-coded to stay inside vehicles or bike lanes. On the flip side, these geo-restrictions could be lifted when it's deemed safe or necessary to make traffic flow efficiently through Quayside. In short, the district would have a basic superblock structure similar to Barcelona's. But the rules and physical makeup of each street could be tweaked to maximize throughput or the health and happiness of Torontonians. \"Our hope is that, as cities enter the 2020s, that old question of whom streets are for will be resolved,\" Willa Ng, mobility lead for Sidewalk Labs,  wrote in a blog post  today. \"The street will once again be a place to stroll, play, and get around safely  --  for everyone.\" The Alphabet subsidiary will test its ideas with a range of real-world prototypes over the coming year. For now, though, the superblock concept is still theoretical, just like the rest of Quayside. Sidewalk Labs won the right to develop a Master Innovation and Development Plan (MIDP) in late 2017. That document,  which still hasn't been published , will need to be evaluated and, ultimately, approved by a range of parties including Waterfront Toronto -- a publicly funded organization -- the Canadian government and, of course, the public. There's no guarantee that any of these parties will say yes, either. Sidewalk Labs has faced a wealth of opposition from resident groups  such as #BlockSidewalk  who fear the project will only benefit Silicon Valley."},
{"text": "Imogen Heap  hums the opening bars to  Breathe In  before pinching her fingers, instructing a sequencer to begin playing it on a loop. She opens her palms wide and makes a fist, as if holding a drumstick, and begins thumping the song's beat. Piece by piece, Heap constructs the song until she is ready to begin singing, without ever touching an instrument. Mi.Mu smart gloves , which she dreamt up in 2010, made this possible. Eight years of R&D later, and the gloves are ready for everyone to buy. \"I always longed for more expressive control of the tech in the studio and on stage,\" said the Grammy winner, back in  2012 . Inspired by MIT's  Elly Jessop , and  Max Matthews  before that, Heap's gloves enable electronic musicians to step out from behind their banks of gear to actually  perform  to their audience. The first pair of Mi.Mu gloves were created by Heap alongside researchers at the University of the West of England in Bristol. The idea was to use them as part of a live show for Earth Day, with an initial setup that included gloves, a backpack and bolero to house all the tech. Refinements to the system shrunk the technology to just the gloves, which Heap has used in shows ever since. And Heap has been a prominent ambassador for her new concept, showing them off at various music, technology and arts conferences. Around 30 pairs of these prototype / first-generation gloves were made and were essentially hacked together. Because they were mostly intended as little more than custom prototypes for touring musicians, the initial models cost £5,000 (around $6,400). But they quickly found an audience.  Arianna Grande  used a pair during her 2015 tour. \"The first models were hand-sewn by Rachel,\" said Dr. Tom Mitchell, who created the gloves with Heap. Rachel is  Rachel Freire , a fashion and costume designer, making each pair in between jobs on movies like  Avengers: Age of Ultron  and  Alien: Covenant . \"It would take me about two days, solid, just to  stitch  the gloves,\" said Freire, who also designed the gloves. Much has changed between then and now, and while Freire still hand-makes the gloves, the process is a little faster. At an intimate launch in North London, UK, the company showed off a new edition of Mi.Mu, demonstrated through performances by  Chagall van den Berg  and  Lula Mehbratu.  Heap herself was absent, journeying to Toronto to perform at a Blockchain conference. Mitchell and his team have made a number of refinements to the gloves as Mi.Mu has evolved into a genuine consumer product. For one, the flex sensors have been redesigned for better accuracy, so it can pick up subtle pinch gestures with the fingers. That offers a greater variety of controls and enables performers to move in a more natural way. A redesigned IMU (inertial measurement unit) helps ensure the gloves always know where they are in three-dimensional space. The prior models often needed to be told which way the performer was facing to avoid errors creeping in. Another big problem was latency, with a noticeable delay between a command and an action with the first version. This time around, the gloves use 802.11n WiFi, which has ensured that when someone does an action, the system instantly obeys the command. Finally, the new gloves have removable batteries, chunky cells that, the company promises, will run for six hours on a charge. Artists will be able to swap in a fresh battery between a sound check and a live show, ridding them of panic over power. These batteries were originally designed for vapes, but suit Mi.Mu's purposes perfectly. With an eye on durability and sustainability, Friere looked for materials that were both recyclable and hard-wearing. She eventually settled on Yulex, a natural, environmentally friendly alternative to Neoprene popularised by sportswear-company Patagonia. The material, along with some tactical gluing, helps strengthen the gloves, since they have both an open palm and no fingertips. This time around, the gloves are glued in layers rather than sewn, helping them look sleeker and feel more comfortable. It's a practice created by Nick Turner's Sew Systems and is more commonly found in high-end lingerie and sportswear. It's indicative of the very broad, multidisciplinary team that Heap and Mitchell assembled to create this new type of product. \"We want people to be able to express themselves,\" said Mi.Mu's chief, Adam Stark, on the future direction of the company. The hope is that, eventually, the Mi.Mu gloves will fall in cost to be the price of an electric guitar, but it'll take some time to get there. In the meantime, the gloves have found many uses that its creators didn't conceive of, including use by  disabled musicians .  Kris Halpin  has cerebral palsy, so struggles to play the guitar and piano -- but has no problem using the gloves. I tried the new Mi.Mu gloves very briefly, but the differences between them and the first version were staggering. The latency and fuzziness of the gestures seem to be all gone, replaced with a seamless setup that makes the virtual feel very real. Drumming on a virtual kit, you can pretty much pretend that you're Phil Selway, with line after line of drums in front of you. Both Mitchell and Freire describe the initial editions of the Mi.Mu as \"bespoke tailoring\" thanks to the painstaking process of assembly. That, combined with the £5,000 price and very long lead time meant that the gloves weren't -- until this point -- ever actually on sale. \"People would email in, asking how they could become part of this 'exclusive club,'\" said Adam Stark. With the price cut in half to £2,500 (around $3,220) and mass production on the way, the days of the exclusive club are gone. The new Mi.Mu gloves are available to pre-order today, with deliveries expected to commence on July 1st."},
{"text": "AT&T is still in hot water over its  5GE logo , but that's not slowing the company down. This week, the  not-really-5G  icon  showed up  in the Android Open Source Project (AOSP). Meaning, whether you like it or not, 5GE could start showing up on Android smartphones using AT&T. According to  XDA Developers , the AOSP code suggest that phones will only need to use 4G LTE with Carrier Aggregation to prompt the icon, so as critics have said, there's no guarantee that the logo will be anything more than a visual change. AT&T introduced the 5GE (5G Evolution) in January on Samsung's  Galaxy S8 Active  and LG's  V30 . But as true 5G networks are  still being tested , 5GE really indicates 4G LTE-Advanced -- a mix of 4G LTE plus technologies like 4x4 MIMO antennas, 256 QAM and carrier aggregation. AT&T's competitors were quick to  mock  and dispute the icon. And a  study by OpenSignal  claimed the so-called 5GE network tested slower than enhanced 4G on Verizon and T-Mobile, though AT&T said the methodology was flawed. The problem, critics charge, is that the label is misleading and will only confuse people, especially when actual 5G coverage is available. As Verizon  previously wrote , \"The potential to over-hype and under-deliver on the 5G promise is a temptation that the wireless industry must resist.\" But this isn't all that different from when AT&T  started using the 4G label  while everyone else was still on 3G. Now that the 5GE icon is available in AOSP, there's a good chance that, as AT&T promised, we'll begin seeing a lot more of it. Verizon owns Engadget's parent company, Verizon Media. Rest assured, Verizon has no control over our coverage. Engadget remains editorially independent."},
{"text": "Would the promise of free (virtual) stuff tempt you ditch Twitch and opt for Microsoft's alternative game live streaming service? That's what Mixer is banking on, and is launching Mixer Loot, a way for players to \"earn in-game content\" if you've watched a \"cool moment.\" The first Mixer Loot festival will run from April 30th to May 5th, and involve people watching 30 arena battles in  Sea of Thieves . Do so on compatible channels, and you'll get the Obsidian Six item pack, which includes the Eye of Reach and a Spyglass. In order to be eligible, you'll need to watch channels that include a Loot icon, letting you know that you're racking up views. You'll also be able to track your progress inside Mixer's settings pane, just hit the \"My Loot\" button to find out how many more matches you've gotta sit through. To power this, Mixer is using the same AI highlight detection technology it uses to power its  HypeZone  system. The only question is if Microsoft will be able to tempt people away from Twitch in large enough numbers for little morsels of DLC."},
{"text": "PodcastOne, The  Joe Rogan Experience , Barstool Sports and other major podcasters have  pulled  their shows from Luminary, the startup network that  launched  with fanfare and $100 million in funding. The main problem seems to be that the network used a proxy for the podcast streams rather than serving up the originals, depriving the creators of valuable listener statistics. \"If I go in and click play on a show on Luminary, we as a platform do not get real data back,\" Simplecast CEO Brad Smith told  The Verge . Luminary was launched with the idea of offering high-quality, curated podcasts in an $8 per month subscription. At the same time, it also has a free tier with podcasts that are available around the web, exactly like Overcast, Apple Podcasts and other podcast apps. The company has previously stated that it wants to eschew advertising and become \" the Netflix of podcasts .\" However, the free tier seems to have alienated podcast creators, much as Spotify did with recording artists. PodcastOne, which has a 300 show portfolio, railed publicly against it. \"Since Luminary's focus has been promoted solely as a paid subscription model, we were surprised to see them also use the free model which they have spoken negatively about and compete against,\" said executive chairman Norm Pattiz. \"If they want to reach our audience to promote their site, then they should do the 'unthinkable' and advertise in our podcasts as hundreds of other advertisers do.\" Meanwhile,  The Joe Rogan Experience  cited licensing as the reason it asked to be removed from Luminary. \"There was not a license agreement or permission for Luminary to have  The Joe Rogan Experience  on their platform,\" a representative told  Hot Pod News . \"His reps were surprised to see the show there today and requested it be removed.\" Luminary has said that it used a \"pass-through\" proxy approach to feeds in order to speed up streaming, not deprive creators of audience data. It has since made adjustments to how it processes the audio in an effort to address creators' complaints. It gave the following statement to The Verge: That seemed to satisfy some creators, including  Exponent  creator Ben Thompson, who  tweeted  \"I have no issue with Luminary's business model. I simply want my content and feed respected, and it is now.\" Other have said that the biggest issue was a lack of transparency on Luminary's part. \"[I] probably would have added our show to Luminary if they had just asked, but instead I'm here making a takedown request,\"  tweeted  Charged Tech podcast creator Owen Williams. "}
]